# Series 1 - Episode 1

The schema of the data is as shown below:


- InvoiceNo: Identifier for each transaction
- StockCode: Product code for each item
- Description: Product Description
- Quantity: Quantity of products sold per transaction
- InvoiceDate: Date of transaction
- UnitPrice: Price per unit of the product
- CustomerID: Identifier for each customer
- Country: The country from which the order was placed



**Business Questions for the Day**


*Customer Segmentation*:

*Question*: What is the breakdown of customer purchasing behaviour in terms of total revenue generated and total orders placed? How can we segment customers into different tiers based on spending?


*Product Performance Analysis*:

*Question*: Which products are most frequently purchased together? What are the top 10 products that generate the highest revenue, and how does that change per country?


*Churn Prediction*:

*Question*: How many customers have stopped purchasing from the platform over the last six months? Which customer demographics have the highest churn rate?


*Sales Trend Analysis*:

*Question*: What are the monthly sales trends over the last two years, and how do seasonal variations affect sales? Can you identify months with unusual spikes or dips in sales?


*Customer Retention and Lifetime Value (LTV)*:

*Question*: What is the average lifetime value of a customer, and how long do they remain active? How does LTV differ across different regions?

In [5]:
import pandas as pd
import os

In [3]:
os.chdir('C:\\Users\\Thinkbook 14\\OneDrive - University of Lagos\\My Docs\OrbitLearning\\BizSolutionWithSQL\\Series 1\\Episode 1')

In [10]:
df = pd.read_csv('Data\\data.csv', encoding='latin-1')

In [11]:
df.shape

(541909, 8)

In [12]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [30]:
df.InvoiceDate = pd.to_datetime(df.InvoiceDate)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 37.2+ MB

In [2]:
from sqlalchemy import create_engine
from getpass import getpass as gp

In [3]:
pass_ = gp()
engine = create_engine(f"postgresql://postgres:{pass_}@localhost:5432/postgres")
#conn = engine.connect()

········

In [52]:
## Write data to postgres local
df.to_sql('ecommerce_olc11', con=engine, schema='public', index=False, chunksize=100000, method='multi')

541909

In [15]:
import sqldf

## Customer Segmentation

*Question*: What is the breakdown of customer purchasing behaviour in terms of total revenue generated and total orders placed? How can we segment customers into different tiers based on spending?

In [1]:
query = """
SELECT "CustomerID" As customer_id, COUNT(DISTINCT "InvoiceNo") As no_orders,
        SUM("UnitPrice"*"Quantity") As revenue 
FROM public.ecommerce_olc11 
WHERE "CustomerID" IS NOT NULL 
GROUP BY 1 
ORDER BY 3 DESC, 2 DESC
"""

In [6]:
cust_ord_rev = pd.read_sql(query, engine)

In [7]:
cust_ord_rev.head(10)

   customer_id  no_orders    revenue
0      14646.0         77  279489.02
1      18102.0         62  256438.49
2      17450.0         55  187482.17
3      14911.0        248  132572.62
4      12415.0         26  123725.45
5      14156.0         66  113384.14
6      17511.0         46   88125.38
7      16684.0         31   65892.08
8      13694.0         60   62653.10
9      15311.0        118   59419.34

In [10]:
query = """
SELECT "CustomerID" As customer_id, COUNT(DISTINCT "InvoiceNo") As no_orders,
        SUM("UnitPrice"*"Quantity") As revenue, SUM("UnitPrice"*"Quantity")/COUNT(DISTINCT "InvoiceNo") As Avg_Rev_per_Order
FROM public.ecommerce_olc11 
WHERE "CustomerID" IS NOT NULL 
GROUP BY 1 
HAVING COUNT(DISTINCT "InvoiceNo") >= 15
ORDER BY 4 DESC
"""

In [11]:
cust_avg_rev_ord = pd.read_sql(query, engine)
cust_avg_rev_ord.head(10)

   customer_id  no_orders    revenue  avg_rev_per_order
0      12415.0         26  123725.45        4758.671154
1      18102.0         62  256438.49        4136.104677
2      14646.0         77  279489.02        3629.727532
3      17450.0         55  187482.17        3408.766727
4      16684.0         31   65892.08        2125.550968
5      17511.0         46   88125.38        1915.769130
6      15769.0         29   51823.72        1787.024828
7      14156.0         66  113384.14        1717.941515
8      17404.0         18   30300.82        1683.378889
9      14096.0         34   57120.91        1680.026765

In [12]:
## Checking the recent Invoice date in the dataset

query = """
SELECT max(cast("InvoiceDate" as Date)) As Last_InvoiceDate
FROM public.ecommerce_olc11
"""
pd.read_sql(query, engine)

  last_invoicedate
0       2011-12-09

In [14]:
## Checking pattern of purchase for previous month

query = """
SELECT "CustomerID", SUM("UnitPrice"*"Quantity") As Revenue
FROM public.ecommerce_olc11
WHERE cast("InvoiceDate" As Date) > CAST('2011-10-31' As Date) AND cast("InvoiceDate" As Date) < CAST('2011-12-01' As Date)
GROUP BY 1
"""

pd.read_sql(query, engine).describe()

         CustomerID        revenue
count   1711.000000    1712.000000
mean   15294.645237     853.829585
std     1728.032281    8100.714322
min    12349.000000    -295.730000
25%    13816.500000     199.210000
50%    15274.000000     352.345000
75%    16827.500000     642.992500
max    18283.000000  329348.510000

In [16]:
### Creating the segmentation

"""
Class 01: 0 - 200
Class 02: 200 - 300
Class 03: 300 - 500
Class 04: 500 - 1,000
Class 05: Above 1,000
"""

query = """
WITH Customer_Revenue_201111 As (
SELECT "CustomerID" As customer_id, SUM("UnitPrice"*"Quantity") As Revenue
FROM public.ecommerce_olc11
WHERE cast("InvoiceDate" As Date) > CAST('2011-10-31' As Date) AND cast("InvoiceDate" As Date) < CAST('2011-12-01' As Date)
GROUP BY 1
),
customer_seg As (
SELECT customer_id, 
case 
    when Revenue <= 200 then 'Class 01'
    when Revenue > 200 and Revenue <= 300 then 'Class 02'
    when Revenue > 300 and Revenue <= 500 then 'Class 03'
    when Revenue > 500 and Revenue <= 1000 then 'Class 04'
    when Revenue > 1000 then 'Class 05' end As customer_class
FROM Customer_Revenue_201111)
SELECT customer_class, count(customer_id) as no_customers
FROM customer_seg
GROUP BY 1
ORDER BY 1
"""

customer_class = pd.read_sql(query, engine)
print(customer_class)

  customer_class  no_customers
0       Class 01           429
1       Class 02           243
2       Class 03           454
3       Class 04           363
4       Class 05           222

## Product Performance Analysis:

*Question*: Which products are most frequently purchased together? What are the top 10 products that generate the highest revenue, and how does that change per country?

Tab

Invoice No, StockCode
1234       abc
1234       xyz
1234       bat
1111       dec
1111       bat
1111       suv
1111       xyz

using
InvoiceNo, StockCode

Tab t1, Tab t2
t1.InvNo = t2.InvNo and t1.sc < t2.sc
1234, abc, xyz
1234, abc, bat
1234, xyz, bat

In [17]:
### Which products are most frequently purchased together?
query = """
SELECT e1."StockCode" As product1, e2."StockCode" As product2, count(*) as no_occurrence
FROM public.ecommerce_olc11 e1
JOIN public.ecommerce_olc11 e2
ON e1."InvoiceNo" = e2."InvoiceNo" AND e1."StockCode" < e2."StockCode"
GROUP BY 1, 2
HAVING COUNT(*) > 1
ORDER BY 3 DESC
LIMIT 10
"""
pd.read_sql(query, engine)

  product1 product2  no_occurrence
0    22697    22698            905
1    22386   85099B            871
2    22697    22699            861
3    21931   85099B            756
4    22726    22727            711
5    20725    20727            705
6    20725    22383            703
7    22411   85099B            697
8    22698    22699            693
9    20725    22384            654

In [19]:
### Top 10 products with the highest revenue?
query = """
SELECT "StockCode" As product, SUM("UnitPrice"*"Quantity") as Revenue
FROM public.ecommerce_olc11
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10
"""
pd.read_sql(query, engine)

  product    revenue
0     DOT  206245.48
1   22423  164762.19
2   47566   98302.98
3  85123A   97894.50
4  85099B   92356.03
5   23084   66756.59
6    POST   66230.64
7   22086   63791.94
8   84879   58959.73
9   79321   53768.06

In [23]:
### Top 10 products with the highest revenue and how they differ by country?
query = """
WITH product_revenue_by_country As (
SELECT "Country" as country, "StockCode" As product, SUM("UnitPrice"*"Quantity") as Revenue
FROM public.ecommerce_olc11
GROUP BY 1, 2),
ranked_prod_rev_per_country As (
SELECT *, ROW_NUMBER() OVER (PARTITION BY COUNTRY ORDER BY Revenue Desc) ranked_prod
FROM product_revenue_by_country
)
SELECT *
FROM ranked_prod_rev_per_country
WHERE ranked_prod <= 10
ORDER BY country, ranked_prod

"""
pd.read_sql(query, engine)

       country product  revenue  ranked_prod
0    Australia   23084  3375.84            1
1    Australia   22722  2082.00            2
2    Australia   21731  1987.20            3
3    Australia   22720  1978.25            4
4    Australia   22423  1978.20            5
..         ...     ...      ...          ...
374        USA   21124    60.00            6
375        USA   23366    57.20            7
376        USA   20975    46.80            8
377        USA   23296    40.00            9
378        USA   23173    39.80           10

[379 rows x 4 columns]

## Churn Prediction:

*Question*: How many customers have stopped purchasing from the platform over the last six months? Which customer demographics have the highest churn rate?

In [29]:
## 2024
## Apr - Sep (Stop transacting in this period)
2011-12

### We are considering customers that have stopped transacting between Jul-2011 and Dec-2011

query = """
WITH Tx_Cust_before_201107 As (
SELECT "CustomerID" as customer_id
FROM public.ecommerce_olc11
WHERE Cast("InvoiceDate" As Date) < Cast('2011-07-01' As Date) and "CustomerID" is not null
GROUP BY "CustomerID"
),
Tx_Cust_in_Churn_period As (
SELECT "CustomerID" as customer_id
FROM public.ecommerce_olc11
WHERE (Cast("InvoiceDate" As Date) > Cast('2011-06-30' As Date) and Cast("InvoiceDate" As Date) < Cast('2012-01-01' As Date)) and "CustomerID" is not null
GROUP BY "CustomerID"
)
SELECT COUNT(a1.customer_id) As Tx_Cust_before, 
COUNT(case when a2.customer_id is null then a1.customer_id end) as churned_customers,
CAST(COUNT(case when a2.customer_id is null then a1.customer_id end) As float)/COUNT(a1.customer_id)*100 As churned_percent
FROM Tx_Cust_before_201107 a1
LEFT JOIN Tx_Cust_in_Churn_period a2
ON a1.customer_id = a2.customer_id
--WHERE a2.customer_id is null
"""
pd.read_sql(query, engine)

   tx_cust_before  churned_customers  churned_percent
0            3002                977         32.54497

In [32]:
### Demography of those with the highest churn

query = """
WITH customer_country As (
SELECT "Country" as country, "CustomerID" As customer_id
FROM public.ecommerce_olc11
WHERE "CustomerID" is not null
GROUP BY 1, 2
),
Tx_Cust_before_201107 As (
SELECT "CustomerID" as customer_id
FROM public.ecommerce_olc11
WHERE Cast("InvoiceDate" As Date) < Cast('2011-07-01' As Date) and "CustomerID" is not null
GROUP BY "CustomerID"
),
Tx_Cust_in_Churn_period As (
SELECT "CustomerID" as customer_id
FROM public.ecommerce_olc11
WHERE (Cast("InvoiceDate" As Date) > Cast('2011-06-30' As Date) and Cast("InvoiceDate" As Date) < Cast('2012-01-01' As Date)) and "CustomerID" is not null
GROUP BY "CustomerID"
)
SELECT country, count(DISTINCT a1.customer_id) As churned_customers
FROM Tx_Cust_before_201107 a1
LEFT JOIN Tx_Cust_in_Churn_period a2
ON a1.customer_id = a2.customer_id
JOIN customer_country cc
ON a1.customer_id = cc.customer_id
WHERE a2.customer_id is null
GROUP BY 1
ORDER BY 2 DESC
"""
pd.read_sql(query, engine)

                 country  churned_customers
0         United Kingdom                885
1                 France                 18
2                Germany                 16
3                Belgium                  6
4                  Italy                  5
5               Portugal                  5
6                  Spain                  5
7                Austria                  4
8            Switzerland                  4
9            Netherlands                  3
10                 Japan                  3
11             Australia                  2
12               Bahrain                  2
13                Canada                  2
14       Channel Islands                  2
15                Cyprus                  2
16                Greece                  2
17             Lithuania                  1
18                Norway                  1
19               Lebanon                  1
20          Saudi Arabia                  1
21                Israel                  1
22                Sweden                  1
23               Finland                  1
24  United Arab Emirates                  1
25                Brazil                  1
26           Unspecified                  1
27                   USA                  1

## Sales Trend Analysis:

*Question*: What are the monthly sales trends over the last two years, and how do seasonal variations affect sales? Can you identify months with unusual spikes or dips in sales?

## Customer Retention and Lifetime Value (LTV):

*Question*: What is the average lifetime value of a customer, and how long do they remain active? How does LTV differ across different regions?

In [ ]:
query = """

CLV

WITH CustomerPurchases AS (
    SELECT
        CustomerID,
        COUNT(DISTINCT InvoiceNo) AS TotalOrders,
        SUM(Quantity * UnitPrice) AS TotalRevenue,
        MIN(InvoiceDate) AS FirstPurchaseDate,
        MAX(InvoiceDate) AS LastPurchaseDate
    FROM
        transactions
    GROUP BY
        CustomerID
),
CustomerLifetime AS (
    SELECT
        CustomerID,
        TotalOrders,
        TotalRevenue,
        DATEDIFF(MONTH, FirstPurchaseDate, LastPurchaseDate) + 1 AS CustomerLifespanMonths, -- Assuming monthly CLV
        (TotalRevenue / TotalOrders) AS AvgOrderValue, -- Average revenue per order
        (TotalOrders / DATEDIFF(MONTH, FirstPurchaseDate, LastPurchaseDate) + 1) AS PurchaseFrequencyPerMonth -- Purchase frequency per month
    FROM
        CustomerPurchases
)
SELECT
    CustomerID,
    TotalRevenue,
    TotalOrders,
    AvgOrderValue,
    PurchaseFrequencyPerMonth,
    CustomerLifespanMonths,
    (AvgOrderValue * PurchaseFrequencyPerMonth * CustomerLifespanMonths) AS CLV -- Customer Lifetime Value
FROM
    CustomerLifetime
ORDER BY
    CLV DESC;
"""

In [ ]:
cust_lv = pd.read_sql(query, engine)

## Questions?